cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'grc'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'moreutils'
brew 'node'
brew 'openssl'
brew 'pigz'
brew 'pv'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'speedtest_cli'
brew 'spoof-mac'
brew 'ssh-copy-id'
brew 'tree'
brew 'vim', args: ['with-override-system-vi']
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
# cask 'adium'
cask 'adobe-creative-cloud'
cask 'airvpn'
cask 'appcleaner'
cask 'atom'
cask 'bitpay'
cask 'chromecast'
cask 'duet'
cask 'electrum'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'ngrok'
cask 'postgres'
cask 'postico'
cask 'radio-silence'
cask 'resilio-sync'
cask 'rhinoceros'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'vmware-fusion'
cask 'whatsapp'
